package main

import (
	"fmt"
)

/*
🤔もんだい 5: 9x9

  [][]int 型で 9x9 表を作り文字列と同じ出力をしてみよう
*/

func main() {
	fmt.Println("[[1 2 3 4 5 6 7 8 9] [2 4 6 8 10 12 14 16 18] [3 6 9 12 15 18 21 24 27] [4 8 12 16 20 24 28 32 36] [5 10 15 20 25 30 35 40 45] [6 12 18 24 30 36 42 48 54] [7 14 21 28 35 42 49 56 63] [8 16 24 32 40 48 56 64 72] [9 18 27 36 45 54 63 72 81]]")
	fmt.Println(Answer())
}

func Answer() [][]int {
	// 😤
	xy := make([][]int, 9)
	for i := 1; i < 10; i++ {
		xy[i-1] = make([]int, 9)
		for j := 1; j < 10; j++ {
			xy[i-1][j-1] = (i * j)
		}
	}
	return xy
}
